// keywords that you should remember

/*
1. 키워드 = 약속어(특별한 의미로 사용하기 위해 미리 선언된 단어)

2. 리터럴(Literals)
    코드에서 고정된 값으로 표현되는 문자와 데이터 그 자체
    변수에 할당되는 원시값 그 자체를 '리터럴'이라고 부른다.
    "foo는 정수 타입이어서 '리터럴 정수'를 할당해야 해"

3. 식별자(Identifier)
    변수, 상수, 함수, 사용자 정의 타입의 이름
    var name: String = "hihi";

4. 토큰(Token)
    코드의 가장 작은 단위 : 더 쪼갤 수 없다.
    토큰 사이에 빈칸 추가는 지양
    빈칸 여러개도 빈칸 1개로 인식
    리터럴, 키워드, 식별자, 구두점, 연산자 등등

5. 표현식(Expression)
    값, 변수, 연산자의 조합으로 하나의 결과값으로 평가되는 코드 단위

var n: Int = 5; (문장)
17;
n;
n + 7; 
n < 5; 
전부 표현식

6. 문장(Statement)
    문장 또는 구문 : 특정 작업을 실행하는 코드 단위
var n2: Int = 3;
print(n2);
print("Hello World");
전부 문장
*/